#### StairsUndersideSurfaceStyle Enumeration

---

|  |
| --- |
| See Also |

The style of the underside surface of the run.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum StairsUndersideSurfaceStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StairsUndersideSurfaceStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class StairsUndersideSurfaceStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| Stepped | The underside surface of the run is stepped. |
| Smooth | The underside surface of the run is smooth. |

# See Also

Autodesk.Revit.DB.Architecture Namespace